import React, { useState } from 'react'

const ReadMore = ({ children }) => {
  const text = children
  const [isReadMore, setIsReadMore] = useState(true)
  const toggleReadMore = () => {
    setIsReadMore(!isReadMore)
  }
  return (
    <p className='text'>
      {isReadMore ? text.slice(0, 150) : text}
      <span onClick={toggleReadMore} className='read-or-hide'>
        {isReadMore ? '... مشاهده بیشتر' : '  مشاهده کمتر'}
      </span>
    </p>
  )
}

const Content = () => {
  return (
    <footer className='Iphone'>
      <div className='container'>
        <h2>
          <ReadMore>
            گوشی آیفون، پرفروش‌ترین گجت‌ اپل برند جهانی اپل یکی از معروف‌ترین و
            پیشگام‌ترین شرکت‌های تولیدکننده‌ی لوازم الکترونیکی و دیجیتال است.
            این برند از سال 1976 فعالیت خودش در امریکا را آغاز کرده و در حال
            حاضر به‌عنوان یکی از برترین شرکت‌های رایانه‌ای شناخته شده است. این
            شرکت هر ساله سخت‌افزارها و نرم‌افزارهای پیشرفته و شاخصی را طراحی و
            تولید می‌کند که در سراسر دنیا محبوب و پرطرفدار هستند. ازجمله
            مهم‌ترین محصولات برند اپل مک‌بوک، آی‌پد، آی‌مک، آی‌پاد، آیفون، اپل
            واچ و اپل تی‌وی است که همگی آن‌ها از سیستم‌عامل iOS پشتیبانی
            می‌کنند. سیستم‌عامل همراه آی‌اواس تنها برای محصولات دیجیتال شرکت اپل
            است و هیچ برند دیگری اجازه‌ی استفاده از آن را ندارد. فروشگاه اختصاصی
            مربوط به این سیستم‌عامل بانام اَپ استور App Store بر روی تمامی
            گجت‌های شرکت اپل وجود دارد و تمامی نرم‌افزارهای مورد نیاز این
            سیستم‌عامل را فراهم می‌کند. سیستم‌عامل iOS تقریباً هر سال
            به‌روزرسانی می‌شود و امکانات جدیدی را برای کاربران ایجاد می‌کند و
            شرکت اپل با این به‌روزرسانی قصد بهبود رابطه‌ی کاربر با آیفون را
            دارد. همچنین یکی از تفاوت‌های عمده‌ی محصولات شرکت اپل با محصولات
            سایر برندهای مشابه در مرورگر وب آن‌ها است. مرورگر وب آیفون و آیپد
            اپل سافاری است که به طور اختصاصی برای سیستم‌عامل iOS طراحی شده است.
            آیفون، مهم‌ترین محصول اپل یکی از مهم‌ترین و پرفروش‌ترین گجت‌های شرکت
            اپل آیفون است. آیفون نام گوشی های اپل است که تولید آن‌ها از سال 2007
            آغاز شده است. آیفون صفحه کلید ندارد و پس از رونمایی توجه بسیاری از
            افراد در سراسر دنیا را به خود جلب کرد. طراحی، ساخت و کیفیت آیفون از
            همان سال اول بسیار خوب بوده به طوری که در مدت زمان کمی توانست به
            جایگاه خاصی در میان گوشی‌های تلفن همراه دست یابد. شرکت اپل تا اواخر
            سال 2020 بیش از ده‌ها مدل از گوشی های اپل را رونمایی کرد که
            عبارت‌اند از: • آیفون (نسل اول) • آیفون ۳جی • آیفون ۳جی‌اس • آیفون ۴
            • آیفون ۴اس • آیفون ۵ • آیفون ۵ سی • آیفون ۵ اس • آیفون ۶ • آیفون ۶
            پلاس • آیفون ۶اس • آیفون اس‌ای • ایفون ۷ • ایفون ۷ پلاس • آیفون ۸ •
            آیفون ۸ پلاس • آیفون ایکس یا آیفون ۱۰ • آیفون 11 • آیفون 11 پرو •
            آیفون 11 پرو مکس • آیفون 12 • آیفون 12 پرو مکس تمامی مدل‌های گوشی
            های اپل پس از رونمایی جزو بهترین گوشی‌های جهان شناخته شده‌اند.
            گوشی‌های تلفن همراه برند اپل همواره پرچم‌دار هستند و همیشه با
            امکانات خاص و ویژه‌شان طرفدارانشان را غافلگیر می‌کنند. حافظه‌ی داخلی
            آیفون‌ها متفاوت است و در چهار ظرفیت 32، 64، 128 یا 256 تولید
            می‌شوند. رزولوشن عکس آیفون بسیار بالا است و کیفیت عکس‌های دوربین‌های
            آیفون با بهترین دوربین‌های عکاسی قابل رقابت است؛ برای مثال در آیفون
            11 پرومکس که از جدیدترین انواع آیفون است رزولوشن عکس 12 مگاپیکسل
            است. شرکت اپل هر ساله امکانات آیفون را افزایش می‌دهد. این شرکت از
            آیفون سری 7 به بعد گوشی‌های خود را ضدآب و با بدنه‌ی مقاوم طراحی و
            تولید می‌کند به طوری که گوشی همراه «iPhone 11 Pro Max» توانایی
            ماندگاری در عمق چهار متری آب به مدت سی دقیقه را دارد. همچنین در
            مدل‌های جدید آیفون نمایشگر گوشی به پنل Super Retina مجهز شده است.
            این پنل تصاویر باکیفیتی را نشان می‌دهد زیرا پنل در واقع یک صفحه‌ی
            لمسی بسیار باریک است که سبب می‌شود تصاویر با شفافیت و کیفیت بالاتری
            نمایش داده شوند. این صفحه از ماندگاری بسیار بالایی برخوردار است و
            کیفیت آن باگذشت زمان و استفاده‌ی زیاد کاهش نمی‌یابد. خرید انواع گوشی
            آیفون از فروشگاه اینترنتی دیجی‌کالا آیفون در حال حاضر در ایران قیمت
            بالایی دارد اما یکی از بهترین گجت‌های حال حاضر دنیا است و در تمامی
            کشورها محبوبیت دارد. آیفون تنها یک گوشی موبایل نیست بلکه یک دوربین
            حرفه‌ای است که می‌تواند انگیزه‌ی عکاسی و فیلم‌برداری را ایجاد کند.
            آیفون با امکانات بسیارش می‌تواند شبیه یک همراه همیشگی باشد و
            به‌وسیله‌ی آن بسیاری از کارها را سامان داد. بسیاری از افراد هنگام
            خرید گوشی های اپل دغدغه‌ی اصل بودن آن را دارند. فروشگاه اینترنتی
            دیجی‌کالا اصل بودن آیفون و تمامی تجهیزات و محصولات برند اپل را تضمین
            می‌کند. خرید آنلاین آیفون از دیجی‌کالا بسیار آسان است و نیاز به
            مراجعه‌ی حضوری ندارد و درب منزل تحویل داده می‎شود.
          </ReadMore>
        </h2>
      </div>
    </footer>
  )
}

export default Content
